Revit 2027 API
AdaptiveComponentFamilyUtils.GetNumberOfAdaptivePoints Method
 Gets number of Adaptive Point Elements in Adaptive Component Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int GetNumberOfAdaptivePoints(
	Family family
)
Public Shared Function GetNumberOfAdaptivePoints (
	family As Family
) As Integer
public:
static int GetNumberOfAdaptivePoints(
	Family^ family
)
static member GetNumberOfAdaptivePoints :
        family : Family -> int
Parameters
family Family
 The Family
Return Value
Int32
 Number of Adaptive Point Element References in Adaptive Component Family.
Exceptions
Exception | Condition
ArgumentException |  The Family family is not an Adaptive Component Family.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace